In [1]:
import pandas as pd
import numpy as np

In [2]:
#importing DataSET in csv folder to data variable 
data=pd.read_csv('../Csv/Bengaluru_House_Data.csv')

## DATA CLEAN UP

In [6]:
#Droping the coloumns which are of no use or having more null values
data.drop(columns=['area_type','availability','society','balcony'],inplace=True)

In [7]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [ ]:
#Above we can see outliers like 40 bathrooms.

In [9]:
#Shows Available Data after Column Drops
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB